/*
 *  Powered By Luckykeeper <luckykeeper@luckykeeper.site | https://luckykeeper.site | https://github.com/luckykeeper>
 *  @CreateTime   : 2025-6-16 10:34
 *  @Author       : Luckykeeper
 *  @Contact      : https://github.com/luckykeeper | https://luckykeeper.site
 *  @Email        : luckykeeper@luckykeeper.site
 *  @project      : yakushiinL2S
 */

package model

const (
	AppVersion    = "v1_Build20250618"
	YakushiinLogo = `
                  ___           ___           ___           ___           ___                                   ___     
      ___        /  /\         /__/|         /__/\         /  /\         /__/\        ___         ___          /__/\    
     /__/|      /  /::\       |  |:|         \  \:\       /  /:/_        \  \:\      /  /\       /  /\         \  \:\   
    |  |:|     /  /:/\:\      |  |:|          \  \:\     /  /:/ /\        \__\:\    /  /:/      /  /:/          \  \:\  
    |  |:|    /  /:/~/::\   __|  |:|      ___  \  \:\   /  /:/ /::\   ___ /  /::\  /__/::\     /__/::\      _____\__\:\ 
  __|__|:|   /__/:/ /:/\:\ /__/\_|:|____ /__/\  \__\:\ /__/:/ /:/\:\ /__/\  /:/\:\ \__\/\:\__  \__\/\:\__  /__/::::::::\
 /__/::::\   \  \:\/:/__\/ \  \:\/:::::/ \  \:\ /  /:/ \  \:\/:/~/:/ \  \:\/:/__\/    \  \:\/\    \  \:\/\ \  \:\~~\~~\/
    ~\~~\:\   \  \::/       \  \::/~~~~   \  \:\  /:/   \  \::/ /:/   \  \::/          \__\::/     \__\::/  \  \:\  ~~~ 
      \  \:\   \  \:\        \  \:\        \  \:\/:/     \__\/ /:/     \  \:\          /__/:/      /__/:/    \  \:\     
       \__\/    \  \:\        \  \:\        \  \::/        /__/:/       \  \:\         \__\/       \__\/      \  \:\    
                 \__\/         \__\/         \__\/         \__\/         \__\/                                 \__\/    
`
	StartUpString = "高性能ですから！ヾ(≧▽≦*)o" //TODO
)
